Revit 2027 API
TableSectionData.AllowOverrideCellStyle Method
 Identifies if the style can be overridden in the given cell.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowOverrideCellStyle(
	int nRow,
	int nCol
)
Public Function AllowOverrideCellStyle (
	nRow As Integer,
	nCol As Integer
) As Boolean
public:
bool AllowOverrideCellStyle(
	int nRow,
	int nCol
)
member AllowOverrideCellStyle :
        nRow : int *
        nCol : int -> bool
Parameters
nRow Int32
nCol Int32
Return Value
Boolean
 True if allow to override cell style.
Exceptions
Exception | Condition
ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace